[{"url": "https://kidshealth.org/en/parents/sugar-substitutes.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nAre Sugar Substitutes Safe for Kids?\nAre Sugar Substitutes Safe for Kids?\nMedically reviewed by: Kathryn Russel, MS, RDN\nNutrition at Nemours Children's Health\nListen\nPrint\nWhat Are Sugar Substitutes?\nSugar substitutes are artificial (fake) sweeteners. Some food makers use sugar substitutes in place of sugar to make foods and drinks taste sweet. These sweeteners don’t have nutrients to help kids grow. Products like diet soda, sports drinks, or yogurts that are made with them may say “sugar-free” or “zero calorie” on the label.\nTwo common sugar substitutes are aspartame and sucralose. They taste much sweeter than real sugar, so foods and drinks made with them have just a tiny amount. Experts now know that tiny amounts of sugar substitutes are safe for some kids, but only if they eat other foods that give them all the nutrients they need.\nHow Are Sugar Substitutes Different From Sugar?\nOur bodies handle sugar and sugar substitutes in different ways. When we eat sugar, our bodies turn it into energy. But they can’t do this with sugar substitutes. Instead, these pass right through the body.\nAre Sugar Substitutes Safe for My Child?\nSugar substitutes are safe for some kids. It depends on a child’s age and if they have any health problems. Here’s a guide:\nBabies and children younger then 2 years old should never have sugar substitutes. Young children need many nutrients for their brains and bodies to grow well, and sugar substitutes have none.\nMost kids older than 2 can have sugar substitutes as long as they get enough nutrients from their diet to grow normally. This is called balanced eating. Kids over 2 years can have up to 6–8 ounces of foods or drinks made with sugar substitutes a day.\nKids older than 2 who have diabetes can have sugar substitutes if their doctor says it’s OK. Doctors usually prefer that kids with diabetes have drinks made with sugar substitutes because they don’t make blood sugars spike like drinks made with sugar.\nKids older than 2 who have PKU shouldn’t have sugar substitutes because their bodies can’t digest them safely.\nWhat’s the Best Drink for My Child?\nKids should drink what’s right for their age:\nBabies up to 1 year old should drink breast milk or formula. These have all the nutrients babies need to grow.\nToddlers 1–2 years old should drink water and whole milk. Whole milk has the right amount of fat to help toddlers’ young brains grow.\nKids over 2 years old should drink water, and low-fat or nonfat milk. These are always the best choices.\nIf you have questions about sugar substitutes, check with your child’s doctor.\nMedically reviewed by: Kathryn Russel, MS, RDN\nDate reviewed: August 2023\nMORE ON THIS TOPIC FOR:\nParents\nKids\nTeens\nWhat’s Best for Your Baby to Drink?\nNutrition & Fitness Center\nSports Drinks and Energy Drinks\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/skinny-skim-milk.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nDoes Nonfat Milk Provide the Same Nutrients as Whole Milk?\nDoes Nonfat Milk Provide the Same Nutrients as Whole Milk?\nen español: ¿La leche descremada proporciona los mismos nutrientes que la leche entera?\nMedically reviewed by: Mary L. Gavin, MD\nListen\nPrint\nDoes nonfat milk provide the same vitamins and minerals as whole milk?\n– Jayne\nYes, nonfat milk (also called skim milk and fat-free milk) is a good source of protein and provides the same vitamins and minerals as whole milk — with no fat. Because the fat portion of whole milk does not contain calcium, you can lose the fat without losing any calcium.\nReduced-fat (2%), low-fat (1%), and nonfat milk have vitamin A and vitamin D added, since these vitamins are lost when the fat is removed. Natural levels of vitamin D are low, so most milk producers add vitamin D to whole milk. Check the nutrition facts label to learn more about vitamins and minerals in milk.\nMedically reviewed by: Mary L. Gavin, MD\nDate reviewed: March 2022\nMORE ON THIS TOPIC FOR:\nParents\nKids\nTeens\nLactose Intolerance\nCalcium\nFormula Feeding FAQs: Starting Solids and Milk\nWhen Should Kids Switch to Nonfat Milk?\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/calorie-calculations.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nHow Can I Calculate Calories From Fat?\nHow Can I Calculate Calories From Fat?\nMedically reviewed by: Mary L. Gavin, MD\nListen\nPrint\nI know that only a certain amount of your calories should come from fat, but how do you calculate that percentage?\n– Brian\nTo calculate this, divide a food or drink's calories from fat by total calories (this information is on the product's food label) and then multiply by 100. For example, if a 300-calorie food has 60 calories from fat, divide 60 by 300 and then multiply by 100. That food has 20% of its calories from fat (60÷300=0.2 / 0.2x100=20).\nMost kids and teens should get 25% to 35% of total calories each day from fat.\nToddlers ages 1 to 3 should get 30% to 40% of total calories from fat.\nHealthy adults should get 20% to 35% of calories from mostly monounsaturated or polyunsaturated fats (from nuts and seeds and plant oils such as olive oil or canola oil, etc.).\nSaturated fat and trans fat (for instance, from fatty meats or full-fat dairy products) can raise cholesterol and increase the risk of heart disease. Saturated fats should make up less than 10% of a person's daily total calories. Trans fats should be kept as low as possible.\nMedically reviewed by: Mary L. Gavin, MD\nDate reviewed: January 2018\nMORE ON THIS TOPIC FOR:\nParents\nKids\nTeens\nMyPlate Food Guide\nFats\nCholesterol\nReading Food Labels\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/picky-eater.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nHow Should I Deal With a Picky Eater?\nHow Should I Deal With a Picky Eater?\nen español: ¿Qué puedo hacer si mi hija es muy quisquillosa con la comida?\nMedically reviewed by: Mary L. Gavin, MD\nListen\nPrint\nMy daughter would be happy eating peanut butter and jelly sandwiches for breakfast, lunch, and dinner. How can I get her to eat different foods?\n– Carlene\nIt can be frustrating when kids want to eat the same thing every day — but it's not uncommon. Some kids get stuck on a favorite food while others complain they don't like certain foods, like vegetables.\nOffer your daughter a variety of healthy foods. Encourage her to try the foods you serve, but don't force her to eat them. Set a good example by eating a balanced diet that includes plenty of fruits and vegetables, whole grains, and healthy protein.\nAsk your daughter what fruits, vegetables, and other healthy foods she is willing to try. Look for recipes with ingredients your kids like, and invite them to join you in the grocery shopping, cooking, and serving of foods.\nSince your daughter likes peanut butter, let her put it on other foods, like apples or celery. Sometimes preparing foods differently, presenting foods in interesting ways, or using cookie cutters to cut food into fun shapes can make foods more appealing to picky eaters.\nIt's important not to let a child's pickiness become a source of mealtime tension. Don't cook special meals just for a picky eater, but do include something your daughter likes in every meal. Ask her to take at least two bites of what you made, but it's OK if she chooses not to eat more than that. And it might be tempting, but don't use food as a reward. Telling kids they can have a cookie if they eat their broccoli only reinforces the appeal of the cookie over the veggies.\nIf you have concerns about your child's nutrition, ask your doctor or a nutritionist for more advice on how to handle a picky eater.\nMedically reviewed by: Mary L. Gavin, MD\nDate reviewed: January 2021\nMORE ON THIS TOPIC FOR:\nParents\nKids\nKids and Food: 10 Tips for Parents\nHealthy Eating\nToddlers at the Table: Avoiding Power Struggles\nNutrition Guide for Toddlers\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/pregnancy-fd-allergy.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nI'm Pregnant. Can I Lower My Baby's Food Allergy Risk?\nI'm Pregnant. Can I Lower My Baby's Food Allergy Risk?\nMedically reviewed by: Larissa Hirsch, MD\nListen\nPrint\nI've heard that if I avoid some foods during my pregnancy, like peanuts, I can help prevent my child from developing food allergies later. Is this true?\n– Marlee\nAt this time, doctors do not recommend avoiding particular foods during pregnancy to prevent food allergies. Studies have not shown an effect when mothers avoided foods during pregnancy, even those with a family history of allergies.\nThe key to eating right during pregnancy — and making sure that your baby gets the nutrients to grow healthy and strong — is to eat foods from the different food groups (grains, vegetables, fruits, oils, milk, meat, and beans) and to get more nutrient-rich calories than before. Pregnant women need about 300 extra calories a day, especially later in pregnancy, when babies grow quickly.\nIt's also important to avoid certain foods that can be harmful to a developing baby. Talk to your doctor about what foods are best for you and your baby.\nStudies are ongoing to see if eating particular foods during pregnancy and breastfeeding could offer some protection from food allergies.\nMedically reviewed by: Larissa Hirsch, MD\nDate reviewed: April 2018\nMORE ON THIS TOPIC FOR:\nParents\nPregnant or Breastfeeding? Nutrients You Need\nStaying Healthy During Pregnancy\nEating During Pregnancy\nPeanut Allergy\nFood Allergies Center\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/more-veggies.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nMy Toddler Hates Vegetables. What Can I Do?\nMy Toddler Hates Vegetables. What Can I Do?\nMedically reviewed by: Mary L. Gavin, MD\nListen\nPrint\nMy 2-year-old used to be a pretty good eater. But now she's going through a phase where she won't even try the vegetables I serve. How can I get more veggies into her mouth and off the floor?\n– Mila\nAs most parents know, there are two things you can't force a child to do: eat and sleep. This is especially true of toddlers, who often assert their independence through eating — or not eating — the foods you put on their plates.\nMany toddlers turn their noses up at vegetables. But don't give up — with time and patience, even the pickiest eaters can find several veggies they like (and a few they even love!).\nHere are some tips that might help:\nDon't give in to a food jag. Most young children go through phases where they want to eat the same thing day after day. But that doesn't mean you have to go along with it. Serving a variety of foods, including vegetables, will encourage your daughter to be more flexible when she's hungry.\nIf at first you don't succeed, try and try again. Studies have shown it may take 10 or more tries before a child accepts a new food. Try serving a small portion so it's less overwhelming or consider pairing veggies with something you know she likes.\nAvoid nagging, forcing, bargaining, or bribing. All of these tactics create power struggles and are doomed to fail in the long run. Just continue offering veggie choices and encourage her to give them a try. Keep mealtime moods upbeat.\nSet a good example. Have family meals together and let your child see you eating a variety of nutritious foods yourself. Also, toddlers are more likely to eat what their peers eat, so look for opportunities where she can eat healthfully with friends.\nInvolve her in choosing the vegetables you serve. For example, she could decide whether you'll have green beans or broccoli tonight, or whether you'll bake zucchini or carrot muffins. Simple choices will help her feel a sense of control.\nMake it fun. Try making a veggie face (like cucumber eyes, tomato nose, green bean mouth, and shredded carrot hair). Try serving veggies with yogurt dip or sprinkled with cheese.\nOne thing to keep in mind when serving fresh fruit and veggies: Raw vegetables and hard fruits can be a choking hazard for young children. Be sure to cook them well, and thinly slice or cut them into small enough pieces so that they're not a choking risk.\nMedically reviewed by: Mary L. Gavin, MD\nDate reviewed: March 2022\nMORE ON THIS TOPIC FOR:\nParents\nKids and Food: 10 Tips for Parents\nSnacks for Toddlers\nFeeding Your 1- to 2-Year-Old\nToddlers at the Table: Avoiding Power Struggles\nHandling Picky Eating in Toddlers (Video)\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/bmi-reports.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nWhat Is a BMI Report Card?\nWhat Is a BMI Report Card?\nen español: ¿Qué es un informe escolar del IMC?\nMedically reviewed by: Mary L. Gavin, MD\nListen\nPrint\nMy son is 6 years old, and I just got his BMI report card from school. It says he is overweight. What does that mean? What do I do now?\n– Amy\nBMI, or body mass index, is a calculation that uses height and weight to estimate how much body fat a person has. Childhood obesity is a serious problem, so many schools have added BMI to the annual health screening of their students.\nSome parents are uncomfortable with the idea of a BMI report card. But an overweight child has a greater chance of developing health problems, such as high blood pressure and diabetes. Parents should share the BMI information with their child's doctor, who can help interpret the results and offer advice.\nHere are some tips to help kids maintain a healthy weight:\nEncourage kids to be active every day. Experts recommend that kids get 60 minutes or more of physical activity daily.\nOffer fruits and vegetables at meals and snacks and encourage your child to eat five or more servings a day.\nServe the right portion sizes for your child's age.\nLimit sugar-sweetened beverages and offer low-fat milk or water instead.\nLimit screen time (time spent watching TV, playing video games, using a smartphone, computer, or other device) to less than 2 hours a day.\nSet a good example by eating healthy, being physically active, and limiting the time you spend in front of a screen.\nMedically reviewed by: Mary L. Gavin, MD\nDate reviewed: January 2020\nMORE ON THIS TOPIC FOR:\nParents\nKids\nTeens\nMotivating Kids to Be Active\nYour Child's Weight\nKeeping Portions Under Control\nOverweight and Obesity\nKids and Exercise\nView more\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/formula-shortage.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nWhat Should I Feed My Baby if I Can’t Find Baby Formula in Stores?\nWhat Should I Feed My Baby if I Can’t Find Baby Formula in Stores?\nen español: ¿Qué debo hacer si no puedo encontrar fórmula para bebés en las tiendas?\nMedically reviewed by: Elana Pearl Ben-Joseph, MD\nListen\nPrint\nI’ve noticed that my supermarket is running out of baby formula, and I’ve heard that there is a nationwide shortage. My baby is too young to start solids. What should I do if I can’t find formula?\n– Stella\nThere is indeed a national shortage of baby formula in the United States. The COVID-19 pandemic created supply chain and staffing issues, and a recent recall of baby formula due to contaminated products from a key factory added to the problem.\nHere are some tips on how to deal with the baby formula shortage:\nTalk to your baby’s doctor. They might have sample cans of formula available and also can ask the manufacturer for specific types of formula. You can also call a local hospital, office of WIC (the federal Special Supplemental Nutrition Program for Women, Infants, and Children), or an established breast milk bank. Women’s shelters, food banks, and faith-based organizations also might be able to help. Avoid using breast milk from friends, community members, or online sources. These donations may not have been properly stored or pasteurized and can contain germs or other harmful substances.\nShop around. Try other stores that you may not have gone to in the past, especially smaller independent grocery stores, pharmacies, or baby supply stores. They might not run out of formula as quickly as bigger stores.\nOrder online if you can. Make sure that the websites are well-recognized companies and not auction sites or online marketplaces that can’t guarantee safe products.\nSwitch to any available formula. This should be OK for most babies unless they are on a specific type of formula for medical reasons. Store-brand formulas are less expensive. Check with your baby’s doctor if you are not sure about making a switch.\nConnect with other parents (in person or on social media groups). They might have extra formula or ideas about where to get some.\nDo not give your baby:\nhomemade formula. This can be dangerous and has even led to infant deaths.\nwatered-down formula to make it last longer. This is dangerous, as it reduces the amount of nutrients in each bottle. Always follow instructions on the package or recommendations from your baby’s doctor.\ngoat milk or plant-based milks (like almond, rice, coconut, or oat milks) if your baby is younger than 1 year old. These milks lack the nutrients your baby needs for growth and development.\nNOTE: Cow’s milk usually is only recommended for babies after their first birthday. In an emergency, though, babies 6 months of age and older who do not get a specific type of formula for medical reasons can drink cow's milk, but for no longer than a week and not more than 24 ounces per day. Cow’s milk does not contain enough iron for a growing baby. So, if you give your baby cow’s milk, also offer iron-containing solid foods or iron supplements. Soy milk also may be OK for a few days for babies who are close to 1 year old, as long as it is fortified with protein and calcium.\nformula you bought overseas. Foreign products are not regulated by the U.S. Food and Drug Administration (FDA) and may not be safe. For this reason, goat milk formula is not an option for babies younger than 1 year old because infant-appropriate goat milk formulas are all made overseas.\ntoddler formula. If your baby is nearing their first birthday, though, toddler formula can be OK for a few days.\nIf you run out of formula and can’t find any, in a pinch you can give oral rehydration solution (such as Pedialyte, Enfalyte, or a store brand) for a couple of days. Babies older than 4 to 6 months can also get puréed (finely ground) foods. And remember that babies older than 1 year do not need to drink formula at all — most of their foods can be eaten as solids and they can drink milk or water.\nMore information is available online at:\nU.S. Department of Health & Human Services\nMedically reviewed by: Elana Pearl Ben-Joseph, MD\nDate reviewed: May 2022\nMORE ON THIS TOPIC FOR:\nParents\nFeeding Your Newborn\nIs Homemade Baby Formula Safe?\nFeeding Your 1- to 3-Month-Old\nFormula Feeding FAQs: Preparation and Storage\nFormula Feeding FAQs: Starting Solids and Milk\nView more\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/babies-juice.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nWhen Can My Child Start Drinking Juice?\nWhen Can My Child Start Drinking Juice?\nen español: ¿Cuándo puede comenzar a tomar jugo mi hijo?\nMedically reviewed by: Madhu Desiraju, MD\nPrimary Care Pediatrics at Nemours Children's Health\nListen\nPrint\nMy 9-month-old seems interested in trying new foods. I’d like to offer him juice, but I’m not sure if he's ready and, if he is, what type of juice drinks to give him. Any suggestions?\n– Miranda\nIt's best to wait until after a baby is 12 months old before offering juice. But even then, pediatricians don't recommend giving toddlers juice often. That's because it adds extra calories without the balanced nutrition in formula and breast milk. Drinking too much juice also may lead to excess weight and tooth decay, or cause diarrhea in infants and toddlers. \nInstead of juice, serve puréed whole fruits and vegetables. They have important nutrients not found in juice. If your baby seems thirsty, offer a little bit of water between feedings.\nIf a toddler does drink juice, follow these tips:\nServe only 100% fruit juice, not juice drinks or powdered drink mixes (which are sweetened).\nLimit the juice to no more than 2–4 fl. oz. (60–120 ml.) per day.\nOffer juice in a cup, not in a bottle.\nServe juice only at meal times.\nNever give juice to a child who has diarrhea or as a treatment for dehydration.\nMedically reviewed by: Madhu Desiraju, MD\nDate reviewed: June 2022\nMORE ON THIS TOPIC FOR:\nParents\nFormula Feeding FAQs: Starting Solids and Milk\nBreastfeeding FAQs: Solids and Supplementing\nCaffeine\nSnacks for Toddlers\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}, {"url": "https://kidshealth.org/en/parents/start-skim-milk.html", "text": "[Skip to Content]\nFind care at Nemours Children's Health Doctors Locations\nFor Parents\nFor Kids\nFor Teens\nFor Educators\nSEARCH\nKidsHealth\nParents\nWhen Should Kids Switch to Nonfat Milk?\nWhen Should Kids Switch to Nonfat Milk?\nMedically reviewed by: Elana Pearl Ben-Joseph, MD\nListen\nPrint\nI know that at some point kids should drink nonfat milk as part of a low-fat diet. But what's the right age to switch kids from whole milk to nonfat milk?\n– Sheila\nBreast milk is the food of choice for at least the first year or beyond. Cow's milk should be avoided until after kids reach their first birthday.\nBabies and toddlers need fat in their diets for a variety of reasons, including healthy brain development. So it's usually recommended that kids 1 to 2 years old drink whole milk. Then, if their growth is steady, it's safe to switch to low-fat or nonfat (skim) milk.\nNote: Kids at risk of becoming overweight can be switched to lower-fat milk before turning 2.\nTalk to your doctor if you have any concerns about your child's growth or nutritional needs.\nMedically reviewed by: Elana Pearl Ben-Joseph, MD\nDate reviewed: August 2018\nMORE ON THIS TOPIC FOR:\nParents\nLactose Intolerance\nCalcium\nDoes Nonfat Milk Provide the Same Nutrients as Whole Milk?\nFeeding Your 1- to 2-Year-Old\nMouth and Teeth\nView more\nShare:\nShare to Facebook\nShare to Twitter\nShare to Pinterest\nAbout Us\nContact Us\nPartners\nEditorial Policy\nPermissions Guidelines\nPrivacy Policy & Terms of Use\nNotice of Nondiscrimination\nNote: All information on Nemours® KidsHealth® is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor.\n© 1995-2023. The Nemours Foundation. Nemours Children's Health®, KidsHealth®, and Well Beyond Medicine® are registered trademarks of The Nemours Foundation. All rights reserved.\nImages sourced by The Nemours Foundation and Getty Images."}]